# -*- coding: utf-8 -*-
"""

HITS算法已经集成到networkx中
下面是一个小例子
1 不带权重的图:
hub:  [('e', 0.2807764063348123), ('f', 0.2807764063348123), ('c', 0.15767078099556311), ('d', 0.15767078099556311), ('a', 0.12310562533924918), ('b', 0.0)]
auth:  [('a', 0.5615528136917185), ('b', 0.43844718630828144), ('c', 0.0), ('e', 0.0), ('d', 0.0), ('f', 0.0)]
2 带权重的图:
hub:  [('e', 0.40723901698682385), ('f', 0.24634327867472502), ('a', 0.1462688530109989), ('c', 0.10007442566372612), ('d', 0.10007442566372612), ('b', 0.0)]
auth:  [('b', 0.5937602754899364), ('a', 0.4062397245100637), ('c', 0.0), ('e', 0.0), ('d', 0.0), ('f', 0.0)]

"""
import networkx as nx
import matplotlib.pyplot as plt
DG = nx.DiGraph()

# 不带权重
# DG.add_edges_from([('a', 'b'), ('c', 'a'), ('d', 'a'), ('e', 'a'), ('f', 'a'), ('e', 'b'), ('f', 'b')])

# 带权重
DG.add_weighted_edges_from([('a', 'b', 1.0), ('c', 'a', 1.0), ('d', 'a', 1.0), ('e', 'a', 1.0), ('f', 'a', 1.0), ('e', 'b', 2.1), ('f', 'b', 1.0)])

h, a = nx.hits(DG)

print "hub: ", sorted(h.items(), lambda x, y: cmp(x[1], y[1]), reverse=True)
print "auth: ", sorted(a.items(), lambda x, y: cmp(x[1], y[1]), reverse=True)

nx.draw(DG, with_labels=True)
plt.show()